glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32665.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Maxim</vendor>
   <name>MAX32665</name>
   <url>http://www.mxim.net/microcontroller/pack/</url>
   <description>Maxim Integrated MAX32665 Series Device Support, Board Support Package and Examples</description>
   <supportContact>support@maximintegrated.com</supportContact>

   <license>License/END_USER_LICENSE_AGREEMENT.rtf</license>

   <releases>
        <release version="0.3.0" date="2019-04-26">
         -Added advertising-only BLE option (smaller RAM usage) for KEIL
         -Added DTM to BLE Libraries for KEIL
        </release>
        <release version="0.2.9-g" date="2019-04-16">
         -Added advertising-only BLE option (smaller RAM usage)
         -Added DTM to BLE Libraries
        </release>
        <release version="0.2.9-c" date="2019-04-16">
         -Fixed issues regarding backup mode
        </release>
        <release version="0.2.8" date="2019-04-08">
         -Updated BLE IAR Libraries to v1.4
         -Option to use BLE Coprocessor
        </release>         
        <release version="0.2.7-c" date="2019-04-03">
         -Updated MAXUSB Libraries
         -Added ECC Example
        </release>
        <release version="0.2.7-a" date="2019-02-22">
         -Updated BLE IAR Libraries to v1.3
         -Updated BLE Keils Libraries to v1.3
        </release>    
        <release version="0.2.0-6" date="2019-01-25">
         -Updated BLE Keil Libraries to v1.2
         -Fixes to ADC
        </release>      
        <release version="0.2.0-5q" date="2019-01-24">
         -Updated BLE Libraries to v1.2
        </release>      
        <release version="0.2.0-5p" date="2018-11-16">
         -Added USB_CompositeDevice
        </release>
        <release version="0.2.0-5l" date="2018-11-15">
         -Updated BLE KEIL Library 
         -Added BLE_scanner, BLE_beacon to KEIL
        </release>
        <release version="0.2.0-5i" date="2018-11-14">
         -Updated BLE Library 
         -Added BLE_scanner, BLE_beacon
        </release>
        <release version="0.2.0-5d" date="2018-10-24">
         -Added BLE Examples to Keil (dats and fit)
        </release>
        <release version="0.2.0-5c" date="2018-10-23">
         -Added BLE Examples (dats and fit)
        </release>
        <release version="0.2.0-5" date="2018-09-28">
         -Added keil support
         -BLE For Keil
        </release>
        <release version="0.2.0-4i" date="2018-09-27">
         -Added Dual Core Debugging Support
         -Added BLE
        </release>
   	  <release version="0.2.0-4" date="2018-08-29">
   	  	-Added SDHC and USB Drivers
         -Added new examples
         -Name changes
   	  	-Bug fixes
   	  </release>
      <release version="0.1.0-2g" date="2018-08-16">
      	-Refactored Peripheral Drivers
      	-Updates to Examples
      </release>   	
      <release version="0.1.0-1" date="2018-08-13">
      	-Initial limited release of SDK
      </release>
   </releases>

   <keywords>
      <keyword>Maxim</keyword>
      <keyword>MAX32665</keyword>
      <keyword>MAX32666</keyword>
      <keyword>MAX32665 Evaluation Kit</keyword>
      <keyword>Maxim Device Support</keyword>
      <keyword>Device Support</keyword>
      <keyword>Device Family Package Maxim</keyword>
      <keyword>Maxim Evaluation Kit</keyword>
   </keywords>

   <requirements>
      <languages>
         <language name="C" version="99" />
      </languages>
   </requirements>
   
   <devices>
      <family Dfamily="MAX32665-66" Dvendor="Maxim:23">
         <book name="Doc/MAX32665_datasheet.txt" title="MAX32665 Family Data Sheet"/>
         <book name="Doc/MAX32665_userguide.txt" title="MAX32665 Family Users Guide"/>         
         <compile header="Libraries/Device/Maxim/MAX32665/Include/max32665.h" />
         <compile header="Libraries/Device/Maxim/MAX32665/Include/max32665.h" define="MAX32665"/>
         <memory id="IROM1" start="0x10000000" size="0x00100000" startup="1" default="1"/>
         <memory id="IRAM1" access="rwx" start="0x20000000" size="0x00080000" init="0" default="1"/>
         <algorithm name="Flash/MAX32665.FLM" start="0x10000000" size="0x00100000" default="1"/>
         <algorithm  name="FlashIAR/FlashMAX32665.flash" start="0x10000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00080000" default="0" style="IAR"/>
         <description>
         	DARWIN is a new breed of low-power microcontrollers built to thrive in the rapidly evolving Internet of Things (IoT). They are smart, with the biggest memories in their class, and a massively scalable memory architecture. They run forever, thanks to wearable-grade power technology. They are durable enough to withstand the most advanced cyberattacks. DARWIN microcontrollers are designed to run any application imaginable - in places where you would not dream of sending other microcontrollers. 
         	Generation UB microcontrollers are designed to handle the increasingly complex applications demanded by today's advanced battery powered devices and wirelessly connected devices, while providing robust hardware security and Bluetooth(R) 5 Low Energy (BLE) radio connectivity.
         	The MAX32665-MAX32668 UB class microcontrollers are advanced systems-on-chips featuring an Arm(R) Cortex(R)-M4 with FPU CPU for efficient computation of complex functions and algorithms with integrated power management. They also include the newest generation Bluetooth 5 Low Energy radio with support for long range (4x) and high throughput (2Mbps) and Maxim's best-in-class hardware security suite trust protection unit (TPU). The devices offer large on-board memory with 1MB flash and up to 560KB STAM that can be configured as 447KB SRAM with error correction coding (ECC). Split flash banks and 512KB each support seamless over the air upgrades, adding an additional degree of reliability. Memory scalability of data (SRAM) and code (flash) space is supported two SPI execute-in-place (SPIX) interfaces. 
         	Multiple high-speed interfaces are supported included HS_USB, secure digital interface (SD, SDIO, MMC, SDHC, and microSD(tm)), SPI, UART, and I2C serial interfaces, and TDM interfaces. An 8-input 10-bit ADC is available to monitor analog inputs from external sensors and meters. The devices are available in 109-bump WLP (0.35mm pitch) and 121-bump CTBGA (0.65mm pitch) packages.
         </description>
         <feature type="IOs" n="48"/>
         <feature type="NVIC" n="110" name="NVIC"/>
         <feature type="DMA" n="16" name="DMA"/>
         <feature type="Timer" n="6" m="32" name="Timer Module"/>
         <feature type="WDT" n="3"/>
         <feature type="I2C" n="3" name="I2C"/>
         <feature type="SPI" n="3" m="50000000" name="QSPI"/>
         <feature type="UART" n="3" m="3000000" name="High-Speed UART Interface"/>
         <feature type="USBD" n="1" name="High-Speed USB Device"/>
         <debug svd="SVD/MAX32665/max32665.svd" />

         <debugport __dp="0">
            <swd idcode="0x2BA01477" />
         </debugport>

         <device Dname="MAX32665">
            <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Pname="Cortex-M4" Punits="2" Dfpu="FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000" />
         </device>

