glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32665.pdsc
         <device Dname="MAX32666">
            <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Pname="Cortex-M4" Punits="2" Dfpu="FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000" />
            <feature type="Crypto" n="128.256" name="HW Accelerated Trust Protection Unit"/>
         </device>         
      </family>
   </devices>

   <!-- MAX32665 Evaluation Kit Board Support Package -->
   <boards>
      <board vendor="Maxim" name="MAX32665-66 EvKit" revision="Rev A" salesContact="sales@maximintegrated.com">
         <description>The MAX32665-66 Evaluation Kit provides a convenient platform for evaluating the capabilities of the MAX32665 Family of microcontrollers. The Evaluation Kit also provides a complete, functional system ideal for developing and debugging applications.
         </description>
         <book category="overview" name="Doc/MAX32665_EvKit.txt" title="MAX32665 EvKit Datasheet"/>
         <book category="schematic" name="Doc/MAX32665_EvKitSchematic.txt" title="MAX32665 EvKit Schematic"/>
         <feature type="PWR" n="5" name="USB Powered"/>
         <feature type="MemCard" n="1" name="SD Card Holder"/>
         <feature type="RAM" n="1" name="128kB SPIXR RAM"/>
         <feature type="ROM" n="1" name="8 MB SPIXF NOR-Flash"/>
         <feature type="USB" n="1" name="High-Speed USB Device, Micro-B receptacle"/>
         <feature type="Button" n="3" name="Push-buttons: Reset, 2x User"/>
         <feature type="LED" n="2" name="User LEDs"/>
         <feature type="GLCD" n="1" m="128.128" name="1.3 inch SPI LCD"/>
         <feature type="LineIn" n="1" name="TRS Audio Jack"/>
         <feature type="LineOut" n="1" name="TRS Audio Jack"/>
         <feature type="AIO" n="8" name="Analog Inputs"/>
         <feature type="DIO" n="16" name="Digital IOs"/>
         <mountedDevice Dvendor="Maxim:23" Dname="MAX32666"/>
         <mountedDevice Dvendor="Maxim:23" Dname="MAX32665"/>
         <debugInterface adapter="CMSIS-DAP" connector="10-pin Cortex Debug Connector (0.05 inch connector)"/>
         <debugInterface adapter="JTAG/SW" connector="20-pin Arm Standard JTAG Connector"/>
      </board>
   </boards>

   <!-- Evaluation Kit Example Programs -->
   <examples>
      <example name="Hello_World" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/Hello_World">
         <description>Hello World Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Hello_World.ewp" />
            <environment name="uv" load="ARM/Hello_World.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="Flash" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/Flash">
         <description>Flash Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Flash.ewp" />
            <environment name="uv" load="ARM/Flash.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="FLC"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="GPIO" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/GPIO">
         <description>GPIO Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/GPIO.ewp" />
            <environment name="uv" load="ARM/GPIO.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="I2C" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/I2C">
         <description>I2C Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/I2C.ewp" />
            <environment name="uv" load="ARM/I2C.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="I2C"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>   
      <example name="RTC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/RTC">
         <description>Real Time Clock Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/RTC.ewp" />
            <environment name="uv" load="ARM/RTC.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="RTC" />
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>         
      <example name="SPI" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/SPI">
         <description>SPI Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/SPI.ewp" />
            <environment name="uv" load="ARM/SPI.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>          
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="SPI"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>      
      </example>      
      <example name="TMR" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/TMR">
         <description>Timer Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/TMR.ewp" />
            <environment name="uv" load="ARM/TMR.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>      
      <example name="UART" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/UART">
         <description>UART Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/UART.ewp" />
            <environment name="uv" load="ARM/UART.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="UART"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>      
      <example name="Watchdog" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/Watchdog">
         <description>Watchdog Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Watchdog.ewp" />
            <environment name="uv" load="ARM/Watchdog.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="WDT"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 
      <example name="Pulse Train" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/Pulse_Train">
         <description>Pulse Train Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Pulse_Train.ewp" />
            <environment name="uv" load="ARM/Pulse_Train.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Pulse Train"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 
      <example name="ADC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/ADC">
         <description>Analog to Digital Converter Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/ADC.ewp" />
            <environment name="uv" load="ARM/ADC.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="ADC"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 
      <example name="DMA" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/DMA">
         <description>Direct Memory Access Controller Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/DMA.ewp" />
            <environment name="uv" load="ARM/DMA.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="DMA"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>    
      <example name="HTMR" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/HTMR">
         <description>HTimer Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/HTMR.ewp" />
            <environment name="uvprojx" load="ARM/HTMR.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="HTMR"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 
      <example name="ICC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/ICC">
         <description>Instruction Cache Controller Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/ICC.ewp" />
            <environment name="uv" load="ARM/ICC.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="ICC"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>     
      <example name="Semaphore" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/Semaphore">
         <description>Semaphore Module Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Semaphore.ewp" />
            <environment name="uv" load="ARM/Semaphore.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="SEMA"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>                  
      <example name="AES" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/AES">
         <description>AES Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/AES.ewp" />
            <environment name="uv" load="ARM/AES.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="TPU"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>  
      <example name="CRC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/CRC">
         <description>CRC Module Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/CRC.ewp" />
            <environment name="uv" load="ARM/CRC.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="TPU"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>        
      <example name="MAA" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/MAA">
         <description>Modular Arithmetic Accelerator Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/MAA.ewp" />
            <environment name="uv" load="ARM/MAA.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="TPU"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>     
      <example name="TRNG" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/TRNG">
         <description>Semaphore Module Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/TRNG.ewp" />
            <environment name="uv" load="ARM/TRNG.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="TPU"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>           
      <example name="LP" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/LP">
         <description>Low Power Capabilities Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/LP.ewp" />
            <environment name="uv" load="ARM/LP.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Low Power"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>       
      <example name="USB_CDCACM" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/USB_CDCACM">
         <description>USB to Serial Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/USB_CDCACM.ewp" />
            <environment name="uv" load="ARM/USB_CDCACM.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="UART"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>         
      <example name="USB_HIDKeyboard" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/USB_HIDKeyboard">
         <description>USB Keyboard Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/USB_HIDKeyboard.ewp" />
            <environment name="uv" load="ARM/USB_HIDKeyboard.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>            
      <example name="USB_MassStorage" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/USB_MassStorage">
         <description>USB Mass Storage Device Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/USB_MassStorage.ewp" />
            <environment name="uv" load="ARM/USB_MassStorage.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="SDHC"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="SPIX"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>  
      <example name="USB_CompositeDevice" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/USB_CompositeDevice">
         <description>USB Mass Storage Device Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/USB_CompositeDevice.ewp" />
            <environment name="uv" load="ARM/USB_CompositeDevice.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="SDHC"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="SPIX"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>            
      <example name="DualCore" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/DualCore">
