glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32665.pdsc
         <description>Dual Core Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/DualCore.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Deivce" Cgroup="DualCore"/>
            <component Cbundle="Maxim API" Cclass="Deivce" Cgroup="Semaphore"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>           
      <example name="BTLE Datc" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/BLE_datc">
         <description>BTLE Data Collector Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_datc.ewp" />
            <environment name="uv" load="ARM/BTLE_datc.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>  
      <example name="BTLE Dats" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/BLE_dats">
         <description>BTLE Data Server Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_dats.ewp" />
            <environment name="uv" load="ARM/BTLE_dats.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example> 
      <example name="BTLE HCI UART" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/BLE_hci_uart">
         <description>BTLE HCI UART</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_hci_uart.ewp" />
            <environment name="uv" load="ARM/BTLE_hci_uart.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>       
      <example name="BTLE Fit" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/BLE_fit">
         <description>BTLE Fitness Profile Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_fit.ewp" />
            <environment name="uv" load="ARM/BTLE_fit.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy Fitness Application</keyword>
         </attributes>
      </example>           
      <example name="BTLE Scanner" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/BLE_scanner">
         <description>BTLE Scanner Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_scanner.ewp" />
            <environment name="uv" load="ARM/BTLE_scanner.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy Scanner</keyword>
         </attributes>
      </example> 
      <example name="BTLE Beacon" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/BLE_beacon">
         <description>BTLE Beacon Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_beacon.ewp" />
            <environment name="uv" load="ARM/BTLE_beacon.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy Beacon</keyword>
         </attributes>
      </example>    
      <example name="CordioLib" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/CordioLib">
         <description>Build CordioLibPub for local debugging support</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/CordioLib.ewp" />
            <environment name="uv" load="ARM/CordioLib.uvprojx" />
         </project>
         <attributes>
            <category>Library Project</category>
            <category>MAX32665 Bluetooth LE Stack</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <keyword>CordioLib</keyword>
         </attributes>
      </example>         
      <example name="ECC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32665_EVKIT/ECC">
         <description>Error Checking Code Demo</description>
         <board name="MAX32665-66 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/ECC.ewp" />
            <environment name="uv" load="ARM/ECC.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32665 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="MAX32665 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Error Checking Code</keyword>
         </attributes>
      </example>            
   </examples>

   <conditions>
      <!-- MAX32665 Device Condition -->
      <condition id="MAX32665 Family">
         <description> Maxim Integrated MAX32665 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dfamily="MAX32665-66"/>
      </condition>

      <!-- MAX32665 Device Condition - TPU Enabled Part -->
      <condition id="MAX32665 Device">
         <description> Maxim Integrated MAX32665 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32665"/>
      </condition>

      <!-- MAX32666 Device Condition - TPU Enabled Part -->
      <condition id="MAX32666 Device">
         <description> Maxim Integrated MAX32665 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32666"/>
      </condition>

      <!-- MAX32665/51/52 CMSIS-CORE Condition -->
      <condition id="MAX32665 CMSIS-CORE">
         <description>Maxim MAX32665 Series devices and CMSIS-CORE</description>
         <require Cclass="CMSIS" Cgroup="CORE"/>
         <require condition="MAX32665 Family"/>
         <accept condition="MAX32666 Device"/>
         <accept condition="MAX32665 Device"/>
         <require Cclass="Device" Cgroup="Startup"/>
      </condition>

      <!-- GNUC/Eclipse Compiler Condition -->
      <condition id="Startup GCC">
         <description>Startup files for the GNU C Toolchain</description>
         <require Tcompiler="GCC"/>
      </condition>

      <!-- IAR Embedded Workbench Compiler Condition -->
      <condition id="Startup ARM">
         <description>Startup files for the KEIL Embedded Workbench Toolchain</description>
         <require Tcompiler="ARMCC"/>
      </condition> 
      <condition id="Startup IAR">
         <description>Startup files for the IAR Embedded Workbench Toolchain</description>
         <require Tcompiler="IAR"/>
      </condition>

      <!-- ADC Peripheral Condition -->
      <condition id="MAX32665 CMSIS ADC">
         <description>ADC Interface</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>

      <!-- Standard DMA Peripheral -->
      <condition id="MAX32665 CMSIS DMA">
         <description>Standard DMA</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>

      <!-- FLash Controller Peripheral -->
      <condition id="MAX32665 CMSIS FLC">
         <description>Internal Flash Controller</description>
         <require condition="MAX32665 CMSIS-CORE"/>
         <require condition="MAX32665 CMSIS ICC"/>
      </condition>

      <!-- I2C -->
      <condition id="MAX32665 CMSIS I2C">
         <description>I2C Interface</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>

      <!-- OWM -->
      <condition id="MAX32665 CMSIS OWM">
         <description>1-Wire Master Interface</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>

      <!-- PT -->
      <condition id="MAX32665 CMSIS PT">
         <description>Pulse Train Engine</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>

