glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32665.pdsc
      <!-- RTC -->
      <condition id="MAX32665 CMSIS RTC">
         <description>Real-Time Clock</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>

      <!-- RTC -->
      <condition id="MAX32665 CMSIS SDHC">
         <description>SD Host Controller</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>

      <!-- SPI Peripheral -->
      <condition id="MAX32665 CMSIS SPI XIP RAM">
         <description>SPI-XiP RAM (SPID) Interface</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>

      <!-- SPI Peripheral -->
      <condition id="MAX32665 CMSIS SPI XIP FLASH">
         <description>SPI-XiP Flash (SPIX) Interface</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>

      <!-- SPI Peripheral -->
      <condition id="MAX32665 CMSIS SPI">
         <description>SPI Interface</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>

      <!-- Timer -->
      <condition id="MAX32665 CMSIS TIMER">
         <description>Timers</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>

      <!-- UART -->
      <condition id="MAX32665 CMSIS UART">
         <description>UART</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>

      <!-- WDT -->
      <condition id="MAX32665 CMSIS WDT">
         <description>Watchdog Timers</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>

      <!-- Low Power -->
      <condition id="MAX32665 CMSIS Low Power">
         <description>Low Power API</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>

      <!-- SEMA -->
      <condition id="MAX32665 CMSIS SEMA">
         <description>Semaphore Module</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>

      <!-- GPIO -->
      <condition id="MAX32665 CMSIS GPIO">
         <description>GPIO</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>

      <!-- ICC -->
      <condition id="MAX32665 CMSIS ICC">
         <description>Instruction Cache Controller</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>

      <!-- HTMR -->
      <condition id="MAX32665 CMSIS HTMR">
         <description>HTimer</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition> 

      <!-- SIMO -->
      <condition id="MAX32665 CMSIS SIMO">
         <description>Single Inductor Multiple Output DC/DC Converter</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition> 

      <!-- DualCore -->
      <condition id="MAX32665 CMSIS DualCore">
         <description>DualCore</description>
         <require condition="MAX32665 CMSIS-CORE"/>
         <accept condition="MAX32665 Device"/>
         <accept condition="MAX32666 Device"/>
      </condition> 

      <condition id="MAX32665 CMSIS TPU">
         <description>MAXUSB Device Class</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>      

      <condition id="MAXUSB Core DEP">
         <description>MAXUSB HS Core</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>      

      <condition id="MAXUSB DevClass DEP">
         <description>MAXUSB Device Class</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>      

      <condition id="FatFs DEP">
         <description>FatFs Dependencies</description>
         <require condition="MAX32665 CMSIS-CORE"/>
      </condition>             

      <condition id="MAX32665 BSP DEP">
         <description>Board Support Package</description>
         <require condition="MAX32665 CMSIS-CORE"/>
         <accept condition="MAX32665 Family"/>
         <require Cclass="Device" Cgroup="UART"/>
         <require Cclass="Device" Cgroup="XiP Flash"/>
         <require Cclass="Device" Cgroup="GPIO"/>
      </condition>
   </conditions>

   <components>

      <bundle Cbundle="Maxim BTLE" Cclass="Bluetooth" Cversion="0.3.0">
         <description>Maxim MAX32665 Bluetooth Low Energy Stack</description>
         <doc>Libraries/BTLE/documentation/html/Cordio_Stack_Cordio_Profiles/index.html</doc>
         <component Cgroup="Bluetooth LE" condition="MAX32665 Family">
            <description>MAX32665 Bluetooth Libraries</description>
            <files>
               <file category="include" name="Libraries/BTLE/wsf/baremetal/sources/"/>
               <file category="include" name="Libraries/BTLE/wsf/common/include/"/>
               <file category="include" name="Libraries/BTLE/controller/sources/mac/include/"/>
               <file category="include" name="Libraries/BTLE/controller/sources/mac/ble/lhci/include/"/>
               <file category="include" name="Libraries/BTLE/wsf/common/include/util/"/>
               <file category="include" name="Libraries/BTLE/ble-host/include/"/>
               <file category="include" name="Libraries/BTLE/platform/common/include/"/>
               <file category="include" name="Libraries/BTLE/controller/sources/mac/cfg/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/apps/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/apps/app/"/>
               <file category="include" name="Libraries/BTLE/ble-host/sources/stack/cfg/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/profiles/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/profiles/include/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/include/app/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/services/"/>
               <file category="include" name="Libraries/BTLE/ble-host/sources/stack/hci/"/>
               <file category="include" name="Libraries/BTLE/ble-host/sources/hci/exactle/"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/exactle/hci_cmd.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/exactle/hci_cmd_ae.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/exactle/hci_cmd_enc.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/exactle/hci_cmd_master.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/exactle/hci_cmd_master_ae.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/exactle/hci_cmd_phy.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/exactle/hci_core_ps.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/exactle/hci_evt.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/exactle/hci_tr.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/exactle/hci_vs.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/exactle/hci_vs_ae.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/stack/hci/hci_main.c"/>
               <file category="sourceC" name="Libraries/BTLE/platform/max32665/sources/ll_math.c"/>
               <file category="sourceC" name="Libraries/BTLE/platform/max32665/sources/radio_drv.c"/>
               <file category="include" name="Libraries/BTLE/controller/sources/config/max32665/"/>
               <file category="include" name="Libraries/BTLE/controller/sources/config/"/>
               <file category="include" name="Libraries/BTLE/platform/max32665/"/>
               <file category="include" name="Libraries/BTLE/ble-host/sources/hci/max32665/"/>               
               <file category="library" name="Libraries/BTLE/lib/IAR/cordiolib.a" condition="Startup IAR"/>
               <file category="library" name="Libraries/BTLE/lib/IAR/cordiolibpub.a" condition="Startup IAR"/>
               <file category="library" name="Libraries/BTLE/lib/IAR/maclib.a" condition="Startup IAR"/>
               <file category="library" name="Libraries/BTLE/lib/ARM/cordiolib.lib" condition="Startup ARM"/>
               <file category="library" name="Libraries/BTLE/lib/ARM/cordiolibpub.lib" condition="Startup ARM"/>
               <file category="library" name="Libraries/BTLE/lib/ARM/maclib.lib" condition="Startup ARM"/>
           </files>
         </component>
         <component Cgroup="Bluetooth LE - Coprocessor" condition="MAX32665 Family">
            <description>MAX32665 Bluetooth Libraries - Using BLE Coprocessor</description>
               <RTE_Components_h>
                  <!-- the following content goes into file 'RTE_Components.h' -->
                  #define BLE_SDMA 1
            </RTE_Components_h>
            <files>
               <file category="include" name="Libraries/BTLE/wsf/baremetal/sources/"/>
               <file category="include" name="Libraries/BTLE/wsf/common/include/"/>
               <file category="include" name="Libraries/BTLE/controller/sources/mac/include/"/>
               <file category="include" name="Libraries/BTLE/controller/sources/mac/ble/lhci/include/"/>               
               <file category="include" name="Libraries/BTLE/wsf/common/include/util/"/>
               <file category="include" name="Libraries/BTLE/ble-host/include/"/>
               <file category="include" name="Libraries/BTLE/platform/common/include/"/>
               <file category="include" name="Libraries/BTLE/controller/sources/mac/cfg/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/apps/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/apps/app/"/>
               <file category="include" name="Libraries/BTLE/ble-host/sources/stack/cfg/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/profiles/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/profiles/include/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/include/app/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/services/"/>
               <file category="include" name="Libraries/BTLE/ble-host/sources/stack/hci/"/>
               <file category="include" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_cmd_ae.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_cmd.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_cmd_phy.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_core_ps.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_evt.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_vs_ae.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_vs.c"/>
               <file category="include" name="Libraries/BTLE/ble-host/sources/hci/max32665/"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/max32665/hci_drv.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/max32665/hci_tr.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/stack/hci/hci_main.c"/>
               <file category="sourceC" name="Libraries/BTLE/platform/max32665/sources/ll_math.c"/>
               <file category="sourceC" name="Libraries/BTLE/platform/max32665/sources/radio_drv.c"/>
               <file category="source" name="Libraries/BTLE/platform/max32665/sources/sdma.inc"/>
               <file category="include" name="Libraries/BTLE/controller/sources/config/max32665/"/>
               <file category="include" name="Libraries/BTLE/controller/sources/config/"/>
               <file category="include" name="Libraries/BTLE/platform/max32665/"/>             
               <file category="library" name="Libraries/BTLE/lib/IAR/cordiolib.a" condition="Startup IAR"/>
               <file category="library" name="Libraries/BTLE/lib/IAR/cordiolibpub.a" condition="Startup IAR"/>
               <file category="library" name="Libraries/BTLE/lib/ARM/cordiolib.lib" condition="Startup ARM"/>
               <file category="library" name="Libraries/BTLE/lib/ARM/cordiolibpub.lib" condition="Startup ARM"/>
           </files>
         </component>         
         <component Cgroup="Bluetooth LE - Advertising" condition="MAX32665 Family">
            <description>MAX32665 Bluetooth Libraries - Using BLE Coprocessor</description>
               <RTE_Components_h>
                  <!-- the following content goes into file 'RTE_Components.h' -->
                  #define BLE_SDMA 1
                  #define BLE_SDMA_ADV 1
            </RTE_Components_h>
            <files>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_cmd_ae.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_cmd.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_cmd_phy.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_core_ps.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_evt.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_vs_ae.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_vs.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/max32665/hci_drv.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/max32665/hci_tr.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/stack/hci/hci_main.c"/>
               <file category="sourceC" name="Libraries/BTLE/platform/max32665/sources/ll_math.c"/>
               <file category="sourceC" name="Libraries/BTLE/platform/max32665/sources/radio_drv.c"/>
               <file category="include" name="Libraries/BTLE/wsf/baremetal/sources/"/>
               <file category="include" name="Libraries/BTLE/wsf/common/include/"/>
               <file category="include" name="Libraries/BTLE/controller/sources/mac/include/"/>
               <file category="include" name="Libraries/BTLE/controller/sources/mac/ble/lhci/include/"/>               
               <file category="include" name="Libraries/BTLE/wsf/common/include/util/"/>
               <file category="include" name="Libraries/BTLE/ble-host/include/"/>
               <file category="include" name="Libraries/BTLE/platform/common/include/"/>
               <file category="include" name="Libraries/BTLE/controller/sources/mac/cfg/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/apps/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/apps/app/"/>
               <file category="include" name="Libraries/BTLE/ble-host/sources/stack/cfg/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/profiles/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/profiles/include/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/include/app/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/services/"/>
               <file category="include" name="Libraries/BTLE/ble-host/sources/stack/hci/"/>
               <file category="include" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/"/>
               <file category="include" name="Libraries/BTLE/ble-host/sources/hci/max32665/"/>
               <file category="source" name="Libraries/BTLE/platform/max32665/sources/sdma_adv.inc"/>
               <file category="include" name="Libraries/BTLE/controller/sources/config/max32665/"/>
               <file category="include" name="Libraries/BTLE/controller/sources/config/"/>
               <file category="include" name="Libraries/BTLE/platform/max32665/"/>
               <file category="include" name="Libraries/BTLE/ble-host/sources/hci/max32665/"/>               
               <file category="include" name="Libraries/BTLE/ble-host/sources/stack/hci/"/>                        
               <file category="library" name="Libraries/BTLE/lib/IAR/cordiolib.a" condition="Startup IAR"/>
               <file category="library" name="Libraries/BTLE/lib/IAR/cordiolibpub.a" condition="Startup IAR"/>
               <file category="library" name="Libraries/BTLE/lib/ARM/cordiolib.lib" condition="Startup ARM"/>
               <file category="library" name="Libraries/BTLE/lib/ARM/cordiolibpub.lib" condition="Startup ARM"/>
           </files>
         </component>     
         <component Cgroup="Bluetooth LE - HCI UART" condition="MAX32665 Family">
            <description>MAX32665 Bluetooth Libraries - Using BLE Coprocessor</description>
               <RTE_Components_h>
                  <!-- the following content goes into file 'RTE_Components.h' -->
                  #define BLE_SDMA 1
                  #define BLE_SDMA_ADV 1
            </RTE_Components_h>
            <files>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_cmd_ae.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_cmd.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_cmd_phy.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_core_ps.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_evt.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_vs_ae.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/hci_vs.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/hci/max32665/hci_drv.c"/>
               <file category="sourceC" name="Libraries/BTLE/ble-host/sources/stack/hci/hci_main.c"/>
               <file category="sourceC" name="Libraries/BTLE/platform/max32665/sources/ll_math.c"/>
               <file category="sourceC" name="Libraries/BTLE/platform/max32665/sources/radio_drv.c"/>
               <file category="include" name="Libraries/BTLE/wsf/baremetal/sources/"/>
               <file category="include" name="Libraries/BTLE/wsf/common/include/"/>
               <file category="include" name="Libraries/BTLE/controller/sources/mac/include/"/>
               <file category="include" name="Libraries/BTLE/controller/sources/mac/ble/lhci/include/"/>               
               <file category="include" name="Libraries/BTLE/wsf/common/include/util/"/>
               <file category="include" name="Libraries/BTLE/ble-host/include/"/>
               <file category="include" name="Libraries/BTLE/platform/common/include/"/>
               <file category="include" name="Libraries/BTLE/controller/sources/mac/cfg/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/apps/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/apps/app/"/>
               <file category="include" name="Libraries/BTLE/ble-host/sources/stack/cfg/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/profiles/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/profiles/include/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/include/app/"/>
               <file category="include" name="Libraries/BTLE/ble-profiles/sources/services/"/>
               <file category="include" name="Libraries/BTLE/ble-host/sources/stack/hci/"/>
               <file category="include" name="Libraries/BTLE/ble-host/sources/hci/dual_chip/"/>
               <file category="include" name="Libraries/BTLE/ble-host/sources/hci/max32665/"/>
               <file category="source" name="Libraries/BTLE/platform/max32665/sources/sdma_adv.inc"/>
               <file category="include" name="Libraries/BTLE/controller/sources/config/max32665/"/>
               <file category="include" name="Libraries/BTLE/controller/sources/config/"/>
               <file category="include" name="Libraries/BTLE/platform/max32665/"/>
               <file category="include" name="Libraries/BTLE/ble-host/sources/hci/max32665/"/>               
               <file category="include" name="Libraries/BTLE/ble-host/sources/stack/hci/"/>                        
               <file category="library" name="Libraries/BTLE/lib/IAR/cordiolib.a" condition="Startup IAR"/>
               <file category="library" name="Libraries/BTLE/lib/IAR/cordiolibpub.a" condition="Startup IAR"/>
               <file category="library" name="Libraries/BTLE/lib/ARM/cordiolib.lib" condition="Startup ARM"/>
               <file category="library" name="Libraries/BTLE/lib/ARM/cordiolibpub.lib" condition="Startup ARM"/>
           </files>
         </component>                         
      </bundle>

      <bundle Cbundle="Maxim API" Cclass="Device" Cversion="0.3.0">
         <description>Maxim Developed Hardware Abstraction Layer</description>
         <doc>Doc/SDK_Documentation/doxygen.txt</doc>

         <!-- MAX32665 Device Selection -->
         <component Cgroup="Startup" Cversion="0.3.0" condition="MAX32665 Family" >
            <description>System Startup for Maxim MAX32665 Microcontroller</description>
            <RTE_Components_h>
                  <!-- the following content goes into file 'RTE_Components.h' -->
                  #define TARGET 32665   /* Target Device Part Number */
                  #define TARGET_REV 0x4131 /* Target Device Revision Number */
            </RTE_Components_h>
            <files>
               <!-- Include paths for the tools -->
               <file category="include" name="Libraries/Device/Maxim/MAX32665/Include/" version="0.3.0" />
               <file category="include" name="Libraries/MAX32665PeriphDriver/Include/" version="0.3.0" />

               <!-- Keil/ARM device startup file and sub_main to call SystemInit -->
               <file category="sourceAsm" attr="config" version="0.3.0" name="Libraries/Device/Maxim/MAX32665/Source/ARM/startup_max32665.s" condition="Startup ARM" />
               
               <!-- GNUC/Eclipse device startup file -->
               <file category="sourceAsm" attr="config"  version="0.3.0" name="Libraries/Device/Maxim/MAX32665/Source/GCC/startup_max32665.S" condition="Startup GCC" />

