glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32665.pdsc
               <!-- IAR device startup file, low level init and cmain.s -->
               <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32665/Source/IAR/startup_max32665.s" condition="Startup IAR" version="0.3.0" />
               <file category="sourceC" attr="config"  version="0.3.0" name="Libraries/Device/Maxim/MAX32665/Source/IAR/low_level_init.c" condition="Startup IAR" />
               <file category="sourceAsm" attr="config"  version="0.3.0" name="Libraries/Device/Maxim/MAX32665/Source/IAR/cmain.s" condition="Startup IAR" />

               <!-- System, NVIC and device header files common to all platforms -->
               <file category="sourceC" attr="config"  version="0.3.0" name="Libraries/Device/Maxim/MAX32665/Source/system_max32665.c" />
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/nvic_table.c" version="0.3.0" />
               <file category="header" attr="config" name="Libraries/Device/Maxim/MAX32665/Include/max32665.h" version="0.3.0" />
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/mxc_assert.c"  version="0.3.0" />
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/mxc_delay.c"  version="0.3.0" />
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/mxc_lock.c"  version="0.3.0" />
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/mxc_pins.c"  version="0.3.0" />
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/mxc_sys.c"  version="0.3.0" />
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/nvic_table.c"  version="0.3.0" />
            </files>
         </component>

         <component Cgroup="ADC" Cversion="0.3.0" condition="MAX32665 CMSIS ADC"> 
         	 <description>ADC Interface</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/adc.c" version="0.3.0"/>
            </files>
         </component>

         <component Cgroup="DMA" condition="MAX32665 CMSIS DMA" Cversion="0.3.0">
            <description>Standard DMA</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/dma.c" version="0.3.0"/>
            </files>
         </component>

         <component Cgroup="FLC" condition="MAX32665 CMSIS FLC" Cversion="0.3.0">
            <description>Flash Controller for Internal Flash Memory</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/flc.c" version="0.3.0"/>
            </files>
         </component>

         <component Cgroup="I2C" condition="MAX32665 CMSIS I2C" Cversion="0.3.0">
            <description>I2C Interface</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/i2c.c" version="0.3.0"/>
            </files>
         </component>

         <component Cgroup="1-Wire" condition="MAX32665 CMSIS OWM" Cversion="0.3.0">
            <description>1-Wire Interface</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/owm.c" version="0.3.0"/>
            </files>
         </component>

         <component Cgroup="Pulse Train" condition="MAX32665 CMSIS PT" Cversion="0.3.0">
            <description>Pulse Train Engine</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/pt.c" version="0.3.0"/>
            </files>
         </component>

         <component Cgroup="RTC" condition="MAX32665 CMSIS RTC" Cversion="0.3.0">
            <description>Real-Time Clock</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/rtc.c" version="0.3.0"/>
            </files>
         </component>

         <component Cgroup="SDHC" condition="MAX32665 CMSIS SDHC" Cversion="0.3.0">
            <description>SD Host Controller</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/sdhc.c" version="0.3.0"/>
            </files>
         </component>

         <component Cgroup="SPI" condition="MAX32665 CMSIS SPI" Cversion="0.3.0">
            <description>SPI Interface</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/spi.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/spi17y.c" version="0.3.0"/>
            </files>
         </component>

         <component Cgroup="XiP RAM" condition="MAX32665 CMSIS SPI XIP RAM" Cversion="0.3.0">
            <description>SPI eXecute In Place (XIP) Interface</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/emcc.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/spixr.c" version="0.3.0"/>
            </files>
         </component>

         <component Cgroup="XiP Flash" condition="MAX32665 CMSIS SPI XIP FLASH" Cversion="0.3.0">
            <description>SPI eXecute In Place (XIP) Interface For External Code Execution</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/spixfc.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/spixf.c" version="0.3.0"/>
            </files>
         </component>

         <component Cgroup="Timers" condition="MAX32665 CMSIS TIMER" Cversion="0.3.0">
            <description>32-Bit Timers</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/tmr.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/tmr_utils.c" version="0.3.0"/>
            </files>
         </component>

         <component Cgroup="WDT" condition="MAX32665 CMSIS WDT" Cversion="0.3.0">
            <description>Watchdog Timers</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/wdt.c" version="0.3.0"/>
            </files>
         </component>

         <component Cgroup="UART" condition="MAX32665 CMSIS UART" Cversion="0.3.0">
            <description>UART Interface</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/uart.c" version="0.3.0"/>
            </files>
         </component>

         <component Cgroup="ICC" condition="MAX32665 CMSIS ICC" Cversion="0.3.0">
            <description>Instruction Cache Controller</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/icc.c" version="0.3.0"/>
            </files>
         </component>

         <component Cgroup="Low Power" condition="MAX32665 CMSIS Low Power" Cversion="0.3.0">
            <description>Low Power API</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/lp.c" version="0.3.0"/>
               <file category="sourceAsm"  name="Libraries/Device/Maxim/MAX32665/Source/IAR/backup_max32665.s" version="0.3.0" condition="Startup IAR"/> 
            </files>
         </component>

         <component Cgroup="GPIO" condition="MAX32665 CMSIS GPIO" Cversion="0.3.0">
            <description>Low Power API</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/gpio.c" version="0.3.0"/>
            </files>
         </component>

         <component Cgroup="SEMA" condition="MAX32665 CMSIS SEMA" Cversion="0.3.0">
            <description>Semaphore API</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/sema.c" version="0.3.0"/>
            </files>
         </component>

         <component Cgroup="HTMR" condition="MAX32665 CMSIS HTMR" Cversion="0.3.0">
            <description>HTimer API</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/htmr.c" version="0.3.0"/>
            </files>
         </component> 

         <component Cgroup="SIMO" condition="MAX32665 CMSIS SIMO" Cversion="0.3.0">
            <description>SIMO API</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/simo.c" version="0.3.0"/>
            </files>
         </component> 

