glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32665.pdsc
         <component Cgroup="DualCore" condition="MAX32665 CMSIS DualCore" Cversion="0.3.0">
            <description>Dual Core Support API</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/system_core1.c" version="0.3.0"/>
               <file category="sourceAsm" name="Libraries/MAX32665PeriphDriver/Source/startup_core1.S" version="0.3.0" condition="Startup IAR"/>
            </files>
         </component> 

         <component Cgroup="TPU" condition="MAX32665 CMSIS TPU" Cversion="0.3.0">
            <description>Trust Protection Unit API</description>
            <files>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/cipher.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/hash.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/crc.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/maa.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/trng.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAX32665PeriphDriver/Source/mem_utils.c" version="0.3.0"/>
            </files>
         </component>          
      </bundle>

      <bundle Cbundle="MAXUSB" Cclass="USB" Cversion="0.3.0">
         <description>Maxim Developed USB Device Stack</description>
         <doc>Libraries/MAXUSB/readme.txt</doc>
         <component Cgroup="Core" condition="MAXUSB Core DEP">
            <description>MAXUSB Core Files</description>
            <files>
               <file category="include" name="Libraries/MAXUSB/include/core/musbhsfc/" version="0.3.0"/>
               <file category="include" name="Libraries/MAXUSB/include/core/" version="0.3.0"/>
               <file category="include" name="Libraries/MAXUSB/include/enumerate/" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/core/musbhsfc/usb.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/core/usb_event.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/enumerate/enumerate.c" version="0.3.0"/>
            </files>
         </component>
         <component Cgroup="Device Class" condition="MAXUSB DevClass DEP">
            <description>MAXUSB Device Class Files</description>
            <files>
               <file category="include" name="Libraries/MAXUSB/include/devclass/" version="0.3.0"/>
               <file category="include" name="Libraries/MAXUSB/include/util/" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/cdc_acm.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/util/fifo.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/hid_kbd.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/hid_raw.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/msc.c" version="0.3.0"/>
            </files>
         </component>
      </bundle>

      <bundle Cbundle="FatFs" Cclass="File System" Cversion="0.3.0">
         <description>FatFs lightweight Fat filesystem module</description>
         <doc>Libraries/SDHC/ff13/documents/00index_e.html</doc>
         <component Cgroup="FatFs - SDHC" condition="FatFs DEP">
            <description>FatFs File System with Maxim SDHC integration</description>
            <files>
               <file category="sourceC" name="Libraries/SDHC/ff13/Source/diskio.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/SDHC/ff13/Source/ff.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/SDHC/ff13/Source/ffsystem.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/SDHC/ff13/Source/ffunicode.c" version="0.3.0"/>
               <file category="sourceC" name="Libraries/SDHC/Source/sdhc_lib.c" version="0.3.0"/>
               <file category="include" name="Libraries/SDHC/Include/" version="0.3.0"/>
               <file category="include" name="Libraries/SDHC/ff13/Source/" version="0.3.0"/>
            </files>
         </component>
      </bundle>

      <bundle Cbundle="MAX32665 BSP" Cclass="BSP" Cversion="0.3.0">
         <description>MAX32665 Evaluation Kit Board Support Package</description>
         <doc>Doc/MAX32665_EvKit.txt</doc>
         <component Cgroup="EvKit V1" condition="MAX32665 BSP DEP">
            <description>MAX32665 Evaluation Kit Board Setup</description>
            <RTE_Components_h>
               #define BOARD EvKit_V1 /* Target Board */
            </RTE_Components_h>
            <files>
               <file category="include" name="Boards/Maxim/MAX32665_EVKIT/Common/EvKit_V1/Include/"/>
               <file category="include" name="Boards/Maxim/MAX32665_EVKIT/Common/Include/"/>
               <file category="sourceC" name="Boards/Maxim/MAX32665_EVKIT/Common/EvKit_V1/Source/board.c" version="0.3.0"/>
               <file category="sourceC" name="Boards/Maxim/MAX32665_EVKIT/Common/Source/stdio.c" version="0.3.0"/>
               <file category="sourceC" name="Boards/Maxim/MAX32665_EVKIT/Common/Source/pb.c" version="0.3.0"/>
               <file category="sourceC" name="Boards/Maxim/MAX32665_EVKIT/Common/Source/led.c" version="0.3.0"/>
               <file category="sourceC" name="Boards/Maxim/MAX32665_EVKIT/Common/Source/mx25.c" version="0.3.0"/>
           </files>
         </component>
      </bundle>
   </components>
</package>
